const Map<String, String> ruRu = {
  'about_us_title': 'О нас',
  'address_add': 'Добавить',
  'address_address_info': 'Информация об адресе',
  'address_address': 'Адрес',
  'address_cancel': 'Отмена',
  'address_delete_approve': 'Удалить',
  'address_delete_warning_content':
      'Вы действительно хотите удалить этот адрес ?',
  'address_delete_warning_title': 'Удалить адрес',
  'address_hint': 'Введите адрес.',
  'address_success_message': 'Адрес успешно добавлен',
  'address_update': 'Редактировать',
  'cart_add_address': 'Добавить новый адрес',
  'cart_approve': 'Утвердить',
  'cart_discount': 'Скидка',
  'cart_my_cart': 'Корзина',
  'cart_payment_type_title': 'Добавить новый адрес',
  'cart_select_address': 'Выберите адрес',
  'cart_total': 'Всего',
  'cat_brands': 'Бренды',
  'cat_categories': 'Категории',
  'empty_product': "Нет продукта",
  'favorites_appbar_title': 'Избранное',
  'general_cancel': 'Отмена',
  'general_data_not_fount': 'Ничего не найдено',
  'general_error': 'Ошибка',
  'general_search_key': 'Введите ключевое слово',
  'general_search': 'Поиск',
  'general_success': 'Успех',
  'general_try_again': 'Попробуйте еще раз',
  'general_warning': 'Предупреждение',
  'home_all': 'Все',
  'login_btn_txt': 'ВОЙТИ',
  'login_not_member': 'Вы не зарегистрированы ?',
  'login_password': 'Ключевое слово',
  'login_phone': 'Номер телефона',
  'login_register': 'Зарегистрируйтесь.',
  'login_welcome': 'ДОБРО ПОЖАЛОВАТЬ!',
  'nav_cart': 'Корзина',
  'nav_category': 'Категория',
  'nav_fav': 'Избранное',
  'nav_home': 'Главная страница',
  'nav_settings': 'Настройки',
  'order_order_number': 'Номер заказа:',
  'order_order_title': 'Мои заказы',
  'order_status_completed': 'Успешно',
  'order_status_pending': 'В ожидании',
  'order_status_processing': 'Обрабатывается',
  'order_total_item_count': 'Количество: ',
  'orders_my_orders': 'Мои заказы',
  'product_add_to_cart': 'Добавить в корзину',
  'product_new': 'Новый',
  'product_related_products': 'Сопутствующие товары',
  'reg_form_name': 'Имя',
  'reg_form_phone': 'Номер телефона',
  'reg_form_pwd_new_rpt': 'Новое ключевое слово',
  'reg_form_pwd_new': 'Новое ключевое слово',
  'reg_form_pwd': 'Kлючевое слово',
  'reg_phone_already_registered': 'Номер телефона зарегистрирован',
  'reg_register_desc': 'Зарегистрируйтесь, чтобы продолжить',
  'reg_register_short': 'Зарегистрируйся',
  'reg_register': 'Зарегистрируйтесь.',
  'retry_icon_text': 'Повторить попытку',
  'retry_info_text': 'Что-то пошло не так.',
  'settings_about_us': 'О нас',
  'settings_address': 'Мои адреса',
  'settings_contact': 'Контакт',
  'settings_lang': 'Язык',
  'settings_logout_body':
      'Вы действительно хотите выйти ? Вам нужно будет снова войти в систему, чтобы использовать наш сервис',
  'settings_logout': 'Выйти',
  'settings_order_history': 'История заказов',
  'settings_theme': 'Темная тема',
  'settings_title': 'Профиль',
  'validation_invalid_phone': 'Неверный формат номера телефона',
  'validation_is_reqired': 'необходимo',
  'validation_min_6_char': 'Минимум 6 символов',
  'validation_password_not_match': 'Пароли не совпадают',
  'login_login': 'Зарегистрируйся',
  'login_write_something': 'Зарегистрируйтесь, пожалуйста.',
  'general_please_login': 'Пожалуйста, войдите!',
  'back': 'Назад',
  'cart_updated': 'Корзина обновлена',
  'settings_delete_account': 'Удалить аккаунт',
  'settings_delete_account_body': 'Удалить информацию об аккаунте',
  'settings_delete': 'Удалить',
  'settings_profile': 'Обновить информацию об аккаунте',
  'settings_profile_info': 'Информация о профиле',
  'cart_item_removed_from_card': 'Продукт был удален из корзины',
  'product_remove_from_cart': 'Удалить из корзины',
  'about_us_text': _aboutUsText,
  'privacy_policy': 'Политика конфиденциальности',
  'privacy_policy_text': _privacyTextHtml,
  'delivery_and_payment': 'Порядок доставки и оплаты',
  'delivery_and_payment_text': _deliveryTextHtml,
};

const _aboutUsText =
    'Теперь подбирать и заказывать цветы стало намного проще с помощью приложения «Nur Gül».\n «Nur Gül» - уникальная платформа, где вы сможете приобрести букеты и цветочные композиции, собранные профессиональными флористами на ваш вкус. Удобный функционал и понятный интерфейс приложения поможет вам легко и быстро заказать свежую и гарантировано качественную продукцию. Выбрав наиболее удобный для вас способ оплаты (карта или наличные), вы можете быть уверенны что курьер доставит все в лучшем виде и в максимально короткий срок.\n Для консультации, вы сможете связаться с нашими экспертами и они не только помогут вам в выборе, но и предложат наилучшие варианты композиций на любую сумму. ';

const _deliveryTextHtml =
    '''<div class="delivery_and_payment"><p><strong>Порядок доставки и оплаты:</strong></p>
<ul>
<li style="margin-bottom: 20px;">Доставка осуществляется по городу Ашхабад, Бюзмеин и Анау.</li>
<li style="margin-bottom: 20px;">Минимальная сумма заказа должна быть не менее <strong>50 манат</strong>; заказ от суммы <strong>50-150 манат</strong> стоимость услуги доставки составляет 10 манат; при заказе от <strong>150 манат</strong> доставка осуществляется бесплатно;</li>
<li style="margin-bottom: 20px;">После Вашего заказа по сайту, оператор позвонит Вам для подтверждения заказа (постоянным клиентам по их желанию подтверждение осуществляется автоматизированно);</li>
<li style="margin-bottom: 20px;">Услуга доставки выполняется по указанному Вами адресу и номеру телефона;</li>
<li style="margin-bottom: 20px;">Если заказ не подтвержден то данный заказ не регистрируется и не выполняется. Для подтверждения заказа, удостоверьтесь, что можете принять звонок по указанному Вами номеру телефона. Также проверьте правильность указанного Вами адреса;</li>
<li style="margin-bottom: 20px;">Оплата выполняется после того, как Вы проверите и примите заказ. На платежном документе курьера указана сумма Вашей оплаты. Оплата выполняется наличными и через карту в национальной валюте. Принятый и оплаченный товар возврату не подлежит;</li>
<li style="margin-bottom: 20px;">Если не удается найти владельца заказа в течение 24 часов после подтверждения заказа, то данный заказ аннулируется;</li>
</ul></div>''';

const _privacyTextHtml =
    '''<div class="privacy_policy whitespace-pre-line"><p style="text-align: center;"><span style="text-decoration: underline;"><strong>Пользовательское соглашение</strong></span></p>
<p style="text-align: center;"><strong><u>Политика конфиденциальности и Условия использования</u></strong></p>
<p>Между Нур Гюл – Интернет Маркетом (далее – “Нур Гюл”) и интернет сайтом nurgul.com.tm (далее – “Сайт”), а также его клиентом (далее - “Клиент”) достигнуто соглашение по нижеследующим условиям.</p>
<p><span style="text-decoration: underline;"><strong>Общие положения</strong></span></p>
<ul>
<li>Клиент после завершения регистрации на Сайте, соблюдая условия настоящего Соглашения, внося номер Телефона и ключевое слово, может начать пользоваться Сайтом.</li>
<li>Начало пользования Сайтом означает, что Клиент принимает все условия.</li>
<li>Соглашение теряет силу с момента, как Клиент перестает пользоваться услугами Сайта.</li>
<li>Нур Гюл может в одностороннем порядке внести изменения и дополнения в настоящее Соглашение.</li>
<li>На определенных страницах Сайта, общих положениях, а также в соответствующих разделах, могут быть установлены особые условия. Считается что Клиент, пользующийся нашими услугами, ознакомился и принял наши соответствующие условия.</li>
</ul>
<p><strong><u>Права и обязанности Клиента</u></strong></p>
<ul>
<li>Сайт открыт для общего пользования.</li>
<li>Клиент, используя Сайт, принимает все установленные условия.</li>
<li>Клиент во время пользования Сайтом обязуется действовать согласно законодательству Туркменистана.</li>
<li>Клиент не должен предпринимать действия, препятствующие или усложняющие пользование данным Сайтом другим его пользователям. В случае использования таких действий, он будет исключен Нур Гюл из списка Клиентов и в связи с данными действиями на него будет возложена правовая и материальная ответственность.</li>
<li>Ответственность за сохранение копии переписки внутри сайта и с оператором возлагается на сотрудников сайта. Данное является рекомендацией Нур Гюл. В случае не сохранения копий переписки, Нур Гюл не несет ответственности за их утерю или не сохранение.</li>
<li>Если сотрудничество прекращено Нур Гюл или Клиентом, то, если Клиент не против, право удаления или сохранения принадлежащей ему переписки остается за Нур Гюл.</li>
<li>Клиент несет полную ответственность за правильность вносимой при регистрации или пользовании услугами информации, и в случае недостоверности информации, ответственность за возмещение ущерба Нур Гюл возлагается на Клиента.</li>
</ul>
<p><strong><u>Права и ответственность Нур Гюл</u></strong></p>
<ul>
<li>В случае, если Клиент используя настоящий Сайт, нарушит законодательство Туркменистана и условия настоящего Соглашения, то Нур Гюл имеет право в одностороннем порядке приостановить сотрудничество с данным Клиентом.</li>
<li>Если логин, пароль и прочая информация, переданная Клиенту, необходимая для пользования услугами настоящего сайта будет передана третьим лицам и с их стороны данная информация будет использована для незаконных целей, то за их действия ответственность несет данный Клиент. А также, как и в интернет пространстве Клиент не может использовать посторонний IP-адрес, адрес электронной почты и имя пользователя, так и здесь, без разрешения не может быть использована личная информация Клиента. В случае использования, за все возникающие правонарушения полную ответственность несет Клиент.</li>
</ul>
<p><strong><u>Полученная Информация и ее Использование </u></strong></p>
<p>В период пользования услугами Сайта и/или если Вы являетесь Клиентом нашего Сайта, для оказания Вам высококачественных услуг, необходимо указать Ваше имя, фамилию, адрес электронной почты, пол, дату рождения и адрес доставки. Информация, получаемая на Сайте используется для нижеуказанных целей:</p>
<ul>
<li>Для ведения Вашего личного учета.</li>
<li>Для выполнения заказа и сохранения связи с нашими Клиентами.</li>
<li>Информировать Вас о заказах, услугах и скидках.</li>
<li>Для изучения спроса Клиентов и возможности делать им соответствующие предложения.</li>
<li>Для осуществления трендового и статистического анализа.</li>
</ul>
<p><strong><u>Какие Вы имеете Права?</u></strong></p>
<p>Вы имеете право получить данные о Вашей&nbsp; личной информации, хранящейся у нас. Если информация недостоверна или не в полном объеме, то Вы можете потребовать ее исправления или удаления. Вы можете связаться с нами по нижеуказанным адресам:</p>
<p><strong><u>Адрес:</u></strong>&nbsp;nurgul.com.tm Интернет Маркет</p>
<p><strong><u>E-mail:</u></strong>&nbsp;flowerstorenurgul@gmail.com</p>
<p><strong><u>Телефон:</u></strong>&nbsp;+99361748758 и +99364213234 (Услуги Клиентам 7 дней в неделю с 09:00 по 18:00 часов.)</p>
<p>Потверждаю, что ознакомился с вышеуказанными условиями, понял и обязуюсь их исполнять согласно законодательству.</p></div>''';
